{"text": "The Minneapolis police officer who knelt on George Floyd’s neck had 18 previous complaints against him, according to the police department.One of those complaints was filed by Kristofer Bergh in 2013 when he was 17 years old. Bergh said ex-police officer Derek Chauvin aimed a gun at him for playing with Nerf guns on his way back from school.Bergh says he was on his way back home in a car with some friends when one of them shot a Nerf dart out the window. When they pulled over at Bergh’s house, Chauvin confronted him with a gun aimed at him.“They were telling me to get back in the car. Put my hands up. And so I complied with those orders. I dropped my bags on the ground, put my hands up, slowly got back in the car, trying to not make any sudden movements. They then approached the car. Still with guns drawn and asked which one of us had shot the Nerf dart,” he said.“At that point, they admitted essentially that they knew it was only a Nerf dart and not something more serious. Still, they made the choice to pull real guns on us,\" he said.The police told Bergh’s mother that he and his friends were trying to elude the police but he denies that saying it is “preposterous” because there was no indication that the police were following them. “They didn’t use sirens or anything.”“I think if we were not white, they would have spun that into the narrative. When I got out of the car, after supposedly eluding them, you know, they would have seen that as a threat. And the whole narrative could have been crafted in a different way that many people would probably be saying it was justified.”Bergh said he was horrified to hear about Chauvin’s involvement in George Floyd’s death.“The only thing I could think what would have happened differently if my friends and I weren’t all white, how would Chauvin and his partner have escalated that situation even further, potentially lethally?”Watch the interview:"}