  {"hash": "1ebac3120f9db3fbadd42b4a3168a213bc1c7f3fe639b1852822cb472abe292a", "text": "Protesters running amok. Innocent citizens under siege. Outside actors engaging in terrorist acts. Police struggling to maintain control and in desperate need of reinforcements.That was how Chinese state media portrayed anti-government protests in Hong Kong last year, dismissing calls for greater democracy and an investigation into police brutality by focusing on individual acts of violence and property damage.Throughout the protests, the US was consistent in its support of people's right to take to the streets and have their voice heard. Facing widespread unrest and public anger at home in the wake of the death of George Floyd, the reaction from US President Donald Trump appeared markedly different.On Monday, Trump called for the military to be deployed to \"dominate\" protesters, and demanded states do more to stem \"acts of domestic terror.\"The irony has not been lost on Beijing, which on Thursday marks (or rather doesn't, the date is highly censored) its own military crackdown on anti-government protesters on June 4, 1989.\"Washington's promise of equality and justice for all in the country has remained hollow at best,\" state news agency Xinhua said in a commentary titled \"The coming suffocation of the American dream.\"\"Amid the ongoing anti-racism protests in the country, decision-makers in Washington, instead of trying to sooth the pain and anger of the public, have been fanning the flames, calling protesters 'THUGS,' and threatening them with 'the most vicious dogs, and most ominous weapons,\" the commentary said.China Daily, a state-backed newspaper, noted that \"The US, after the killing of Floyd, seems to be on fire, and troops have been mobilized to subdue angry demonstrators.\"\"This is certainly not what the world expects to see in a country that is the world's sole superpower,\" it added. \"But that sadly is the reality of the US.\"This rhetoric isn't just embarrassing for Washington, it's also a sign of how the US may find its influence damaged by a perceived hypocrisy over human rights at home and abroad.Earlier today, Hong Kong's leader Carrie Lam pointed to the unrest in the US as evidence of Washington's \"double standards.\"\"They attach great importance to the national security of their country, but look at our national security through tinted spectacles, especially the current situation in Hong Kong,\" she added.The ability of Washington to influence Beijing's position on Hong Kong -- which is in part founded on fear of outside influence in the city -- was already severely limited. The Trump administration's reaction to protests at home may have hurt its position even further."}
