{"keyword": ["serious", "trump", "advisers", "protests", "violent", "twitter", "nation", "floyds", "using", "divide", "trumps", "starts", "death", "exists", "nights", "riots", "statement"], "summary": "(CNN) A serious divide has emerged among Donald Trump's top allies and advisers over how the President should address several nights of protests and riots across the nation following the death of George Floyd.\nTrump has adopted an uneven message on the demonstrations.\nSeveral advisers feared, and hoped to avoid, another Charlottesville moment, when Trump was criticized after declaring in 2017 that \"very fine people\" were among the Nazi mobs that descended upon Charlottesville, Virginia.\nWhen the President made his first vague statement on that violence, he blamed the conflicts on \"many sides.\"\nBut he later tried to downplay his message about using armed force on looters as a statement rather than a threat.", "publish_date": "2020-05-31T00:00:00", "text": "(CNN) A serious divide has emerged among Donald Trump's top allies and advisers over how the President should address several nights of protests and riots across the nation following the death of George Floyd. Trump is being urged by some advisers to formally address the nation and call for calm, while others have said he should condemn the rioting and looting more forcefully or risk losing middle-of-the-road voters in November, according to several sources familiar with the deliberations.Trump has adopted an uneven message on the demonstrations. While in some appearances he has taken a measured approach in calling for calm, on Twitter he has used violent rhetoric and seemed to suggest Saturday his supporters stage a counter-protest outside the White House.Over the weekend, some aides sought to convince Trump against using violent rhetoric after he wrote on Twitter that \"when the looting starts the shooting starts,\" warning language like that could inflame an already combustible situation and would not appear presidential.During a staff call Friday, Trump's top domestic policy aide Brooke Rollins argued for a measured response to riots the night before, advice that was echoed by Trump's son-in-law Jared Kushner. Several advisers feared, and hoped to avoid, another Charlottesville moment, when Trump was criticized after declaring in 2017 that \"very fine people\" were among the Nazi mobs that descended upon Charlottesville, Virginia. When the President made his first vague statement on that violence, he blamed the conflicts on \"many sides.\"Trump, who believes his law and order stance helped get him elected, wasn't immediately receptive to those concerns over the last several days about what's currently happening in the nation. But he later tried to downplay his message about using armed force on looters as a statement rather than a threat.Read More", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/200530124647-01-trump-0530-super-tease.jpg", "movies": []}